package com.xiaolin.algorithm.array;

/**
 * @program: spark-scala001 leetcode 36
 * @description: 判断一个 9x9 的数独是否有效。只需要根据以下规则，验证已经填入的数字是否有效即可。
 *
 * 数字 1-9 在每一行只能出现一次。
 * 数字 1-9 在每一列只能出现一次。
 * 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。
 * [
 *   ["5","3",".",".","7",".",".",".","."],
 *   ["6",".",".","1","9","5",".",".","."],
 *   [".","9","8",".",".",".",".","6","."],
 *   ["8",".",".",".","6",".",".",".","3"],
 *   ["4",".",".","8",".","3",".",".","1"],
 *   ["7",".",".",".","2",".",".",".","6"],
 *   [".","6",".",".",".",".","2","8","."],
 *   [".",".",".","4","1","9",".",".","5"],
 *   [".",".",".",".","8",".",".","7","9"]
 * ]
 *
 * @author: linzy
 * @create: 2021-03-03
 **/
public class IsValidSudoku {

    public static void main(String[] args) {
        char[][]  board= {
            //       0X0           0X1         0X2
                {'5','3','.' , '.','7','.' , '.','.','.'},
                {'6','2','.' , '1','9','5' , '.','.','.'},
                {'.','5','8' , '.','.','.' , '.','6','.'},
            //       1X0           1X1         1X2
                {'8','.','.' , '.','6','.' , '.','.','3'},
                {'4','.','.' , '8','.','3' , '.','.','1'},
                {'7','.','.' , '.','2','.' , '.','.','6'},
             //       2X0           2X1         2X2
                {'.','6','.' , '.','.','.' , '2','8','.'},
                {'.','.','.' , '4','1','9' , '.','.','5'},
                {'.','.','.' , '.','8','.' , '.','7','9'}
        };

        System.out.println(isValidSudoku(board));

    }

    public static boolean isValidSudoku(char[][] board) {
        int[][] rows = new int[9][9]; // 数字 1-9 在每一行只能出现一次。
        int[][] col = new int[9][9]; // 数字 1-9 在每一列只能出现一次。
        int[][] sbox = new int[9][9]; //数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。

        for (int i = 0; i < board.length; i++) {
            for (int j = 0; j < board[0].length; j++) {
                if (board[i][j]!='.'){
                    int num = board[i][j] - '1';
                    int index_box = (i/3)*3+j/3; //获取 3X3小九宫格
                    // 数字 1-9 在每一行只能出现一次。
                        if (rows[i][num]==1) {
                            return false;
                        } else {
                            rows[i][num]=1;
                        }
                    // 数字 1-9 在每一列只能出现一次。
                    if (col[j][num]==1) {
                        return false;
                    } else {
                        col[j][num]=1;
                    }
                    //数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。
                    if (sbox[index_box][num]==1)  {
                        return false;
                    } else {
                        sbox[index_box][num]=1;
                    }
                }
            }
        }
        return true;
    }
}
